export default class Plane { //定义了一个名字为Person的类
    constructor(sessionKey) { //constructor是一个构造方法，用来接收参数
        this._sessionKey = sessionKey;
        this._fill = "#faea05"
        this._stroke = "black"
        this._stroke_width = 10

        this._strokeSelected = "#ff9900f5"
        this._fillTimeout = "gray"
        this._iconClass = "init-plane"
        this._className = "custom-init-icon"
    }

    init() { //这是一个类的方法，注意千万不要加上function
        let svgContent = `<svg xmlns="http://www.w3.org/2000/svg" id=${this._sessionKey} class="${this._iconClass}" stroke='black' stroke-width=10 viewBox="0 0 512 512">     
                               <path d="M407.7 224c-3.4 0-14.8.1-18 .3l-64.9 1.7c-.7 0-1.4-.3-1.7-.9L225.8 79.4c-2.9-4.6-8.1-7.4-13.5-7.4h-23.7c-5.6 0-7.5 5.6-5.5 10.8l50.1 142.8c.5 1.3-.4 2.7-1.8 2.7L109 230.1c-2.6.1-5-1.1-6.6-3.1l-37-45c-3-3.9-7.7-6.1-12.6-6.1H36c-2.8 0-4.7 2.7-3.8 5.3l19.9 68.7c1.5 3.8 1.5 8.1 0 11.9l-19.9 68.7c-.9 2.6 1 5.3 3.8 5.3h16.7c4.9 0 9.6-2.3 12.6-6.1L103 284c1.6-2 4.1-3.2 6.6-3.1l121.7 2.7c1.4.1 2.3 1.4 1.8 2.7L183 429.2c-2 5.2-.1 10.8 5.5 10.8h23.7c5.5 0 10.6-2.8 13.5-7.4L323.1 287c.4-.6 1-.9 1.7-.9l64.9 1.7c3.3.2 14.6.3 18 .3 44.3 0 72.3-14.3 72.3-32S452.1 224 407.7 224z"/>
                         </svg>`
        let customColorIcon = L.divIcon({
            iconSize: [30, 30],
            className: this._className,
            html: svgContent
        });
        return customColorIcon;
    }

    selected() {
        this._iconClass = "selected-plane"
        this._className = "custom-selected-icon"
        return this.init();
    }

    timeout() {
        this._iconClass = "timeout-plane"
        this._className = "custom-timeout-icon"
        return this.init();
    }

    focus() {
        this._iconClass = "focus-plane"
        this._className = "custom-focus-icon"
        return this.init();
    }

    custom(fill, stroke, strokeWidth) {
        switch (arguments.length) {
            case 1:
                this._fill = fill
                break;
            case 2:
                this._fill = fill
                this._stroke = stroke
                break;
            case 3:
                this._fill = fill
                this._stroke = stroke
                this._strokeWidth = strokeWidth
                break;
            default:
                break;
        }

        let svgContent = `<svg xmlns="http://www.w3.org/2000/svg" id=${this._sessionKey} fill="${this._fill}" stroke="${this._stroke}" stroke-width=${this._strokeWidth} viewBox="0 0 512 512">     
                               <path d="M407.7 224c-3.4 0-14.8.1-18 .3l-64.9 1.7c-.7 0-1.4-.3-1.7-.9L225.8 79.4c-2.9-4.6-8.1-7.4-13.5-7.4h-23.7c-5.6 0-7.5 5.6-5.5 10.8l50.1 142.8c.5 1.3-.4 2.7-1.8 2.7L109 230.1c-2.6.1-5-1.1-6.6-3.1l-37-45c-3-3.9-7.7-6.1-12.6-6.1H36c-2.8 0-4.7 2.7-3.8 5.3l19.9 68.7c1.5 3.8 1.5 8.1 0 11.9l-19.9 68.7c-.9 2.6 1 5.3 3.8 5.3h16.7c4.9 0 9.6-2.3 12.6-6.1L103 284c1.6-2 4.1-3.2 6.6-3.1l121.7 2.7c1.4.1 2.3 1.4 1.8 2.7L183 429.2c-2 5.2-.1 10.8 5.5 10.8h23.7c5.5 0 10.6-2.8 13.5-7.4L323.1 287c.4-.6 1-.9 1.7-.9l64.9 1.7c3.3.2 14.6.3 18 .3 44.3 0 72.3-14.3 72.3-32S452.1 224 407.7 224z"/>
                         </svg>`
        let customColorIcon = L.divIcon({
            iconSize: [30, 30],
            className: this._className,
            html: svgContent
        });
        return customColorIcon;
    }

    tdoa() {
        this._className = "custom-tdoa-icon"
        let svgContent = `<svg xmlns="http://www.w3.org/2000/svg" id=${this._sessionKey} class="${this._iconClass}" viewBox="0 0 1024 1024">
                               <path transform="rotate(90 512.0125122070314,511.99694824218756) " d="m681.1213,936.32517c-4.02978,6.97179 -11.20827,10.82453 -18.72343,10.82453c-3.5652,0 -7.25933,-0.87902 -10.6168,-2.81409l-150.42601,-85.94135c-6.68322,-3.80567 -10.79281,-10.95244 -10.79281,-18.65896l0,-741.36999c0,-11.86421 9.57712,-21.52115 21.44133,-21.52115c11.87956,0 21.53753,9.65796 21.53753,21.52115l0,728.88156l139.55338,79.80151c10.32925,5.90038 13.89547,19.01201 8.02681,29.27679l0,0zm-158.4518,-77.9309l-150.42601,85.94134c-3.35747,1.93507 -7.0516,2.81409 -10.6168,2.81409c-7.51516,0 -14.69366,-3.85377 -18.72344,-10.82453c-5.86763,-10.26478 -2.30243,-23.37641 8.02682,-29.27577l139.6332,-79.80151l0,-728.88258c0,-11.86421 9.57712,-21.52115 21.44133,-21.52115c11.87957,0 21.53753,9.65796 21.53753,21.52115l0,741.36897c0,7.70754 -4.18942,14.85431 -10.87263,18.65999l0,0zm0,-429.78861l-451.27803,257.87316c-3.35747,1.93507 -7.0516,2.81409 -10.6168,2.81409c-7.46707,0 -14.69366,-3.86912 -18.72344,-10.8409c-5.86764,-10.26479 -2.30244,-23.39176 8.02682,-29.27577l451.27803,-257.87316c10.28116,-5.93211 23.40813,-2.35053 29.29214,7.96235c5.91573,10.31288 2.30142,23.45622 -7.97872,29.34023l0,0zm-10.6649,432.6027c-11.86421,0 -21.44133,-9.5935 -21.44133,-21.47306l0,-741.36999c0,-11.86421 9.57712,-21.52115 21.44133,-21.52115c11.87957,0 21.53753,9.65796 21.53753,21.52115l0,741.36897c0,11.88058 -9.65796,21.47408 -21.53753,21.47408l0,0zm469.96873,-182.75635c-3.94894,6.97178 -11.20828,10.84091 -18.72344,10.84091c-3.5652,0 -7.25933,-0.87902 -10.6168,-2.8141l-310.68497,-177.54362c-10.31288,-5.90038 -13.92618,-19.02736 -8.05854,-29.34024c5.93211,-10.31288 19.02736,-13.91082 29.34024,-7.96234l310.71771,177.54362c10.32823,5.88401 13.89446,19.01099 8.0258,29.27577l0,0z"/>
                          </svg>`
        let customColorIcon = L.divIcon({
            iconSize: [30, 30],
            className: this._className,
            html: svgContent
        });
        return customColorIcon;
    }

    scdw() {
        let svgContent = `<svg xmlns="http://www.w3.org/2000/svg" id=${this._sessionKey} class="${this._iconClass}" viewBox="0 0 1024 1024">
                               <path d="M683.932098 463.747122C564.84839 232.872585 203.701073 61.739707 259.546537 132.370732c55.945366 70.730927 223.381854 320.087415 204.700097 320.087414s-204.700098 7.492683-241.963707-7.492683C185.11922 430.179902 92.110049 285.021659 69.731902 292.414439c-22.478049 7.492683 33.467317 156.347317 33.467318 156.347317v126.476488s-55.945366 148.854634-33.467318 156.347317c22.278244 7.492683 115.387317-137.765463 152.650927-152.650927 37.26361-14.985366 223.381854-7.492683 241.963708-7.492683s-148.854634 249.356488-204.700098 320.087415c-55.745561 70.730927 305.301854-100.501854 424.385561-331.276488 3.69639 0 264.341854 18.681756 275.431024-48.452683-11.288976-66.734829-271.834537-48.053073-275.530926-48.053073z" p-id="3186"></path>
                          </svg>`
        let customColorIcon = L.divIcon({
            iconSize: [30, 30],
            className: this._className,
            html: svgContent
        });
        return customColorIcon;
    }
}